function toggleText() {
    // после let array должен идти знак равно
    // потом квадратные скобки
    // в квадратных скобках вопросы в кавычках через запятую
    // после квадратных скобок идет точка с запятой
    //  let array = [
    //    'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p'
    //  ];
    
    let array = [
        
        
        
        'Виды покровных тканей'
'Эпидермис это'
'Перидерма это'
'Многослойная мертвая ткань на стеблях и корнях многолетних растений'
'Эпидермис, перидерма, корка это'
'Клетки паренхимной формы, лежат плотно в один ряд, без межклетников (первичная ткань, защитная функция) '
'Многослойная гетерогенная ткань, образованная феллогеном'
'Феллодерма это'
'Волоски это'
'Трихомы это'
'Феллема это'
'Корка это'
'Эпидермис состоит из'
'Перидерма состоит из'
'Корка состоит из'
'Устьичный аппарат состоит из'
'Образовательные ткани это'
'Классификация меристем по местоположению в теле растения'
'Классификация меристем по происхождению'
'Верхушечная меристема это'
'Боковая меристема находится и это'
'Вставочная меристема находится и это'
'Раневая меристема это'
'Верхушечная меристема находится и дает рост в'
'Боковая меристема дает рост в'
'Вставочная меристема дает рост'
'Клетки меристемы характеризуются'
'Прокамбий образует'
'Камбий находится и образует'
'Перицикл находится и образует'
'Феллоген находится и образует'
'Механические ткани это'
'Колленхима это'
'Склеренхима это'
'Виды колленхимы'
'Виды склеренхимы'
'Уголковая колленхима это'
'Пластинчатая колленхима это'
'Рыхлая колленхима это'
'Древесинные волокна это'
'Лубяные волокна это'
'Склереиды это'
'Мертвые клетки прозенхимной формы с равномерно утолщенными оболочками'
'Проводящие ткани это'
'Ксилема это'
'Флоэма это'
'Сосуды это'
'Трахеиды это'
'Ситовидные трубки это'
'Ксилема состоит из'
'Флоэма состоит из'
'Ксилема проводит'
'Флоэма проводит'
'Проводящие элементы ксилемы'
'Типы проводящих пучков'
'Проводящие элементы флоэмы'
'Механический компонент ксилемы'
'Механический компонент флоэмы'
'Запасающий  компонент флоэмы'
'Запасающий  компонент ксилемы'
'Сосуды ксилемы бывают'
'Устьица у водных растений располагаются'
'Устьица у большинства растений располагаются'
'Снаружи от эпидермиса может образовываться'
'Основные ткани это'
'Запасающая паренхима это'
'Воздухоносная паренхима это'
'Ассимиляционная паренхима это'
'Столбчатая паренхима это'
'Губчатая паренхима это'
'Складчатая паренхима это'
'Эндодерма это'
'Перицикл это'

        
       
        
    ];
    
    
    
    
    var que_arr = [];
    while(que_arr.length < 10){
        var r = Math.floor(Math.random() * array.length);
        if(que_arr.indexOf(r) === -1) que_arr.push(r);
    }
    document.getElementById("demo1").innerHTML = array[que_arr[0]];
    document.getElementById("demo2").innerHTML = array[que_arr[1]];
    document.getElementById("demo3").innerHTML = array[que_arr[2]];
    document.getElementById("demo4").innerHTML = array[que_arr[3]];
    document.getElementById("demo5").innerHTML = array[que_arr[4]];
    document.getElementById("demo6").innerHTML = array[que_arr[5]];
    document.getElementById("demo7").innerHTML = array[que_arr[6]];
    document.getElementById("demo8").innerHTML = array[que_arr[7]];
    document.getElementById("demo9").innerHTML = array[que_arr[8]];
    document.getElementById("demo10").innerHTML = array[que_arr[9]];
}
